<template>
  <section class="p-About_Container Blog">
    <div class="BlogTitle">
      <div class="BlogTitleImage">
        <img
          src="images/about/top.png"
          srcset="images/about/top.png 1x, images/about/top@2x.png 2x"
          alt="About page top.png"
        >
      </div>
      <h1>自己紹介</h1>
    </div>
    <article>
      <p>こんにちは。当サイトの作者，noribentoです。明治大学で経済を勉強しています。地元ではコテコテの関西弁を操る兵庫人です。</p>
      <p>高校では放送部に所属する傍ら，文化祭で使用する情報モニターのシステム開発を行ってました。ちなみに根っからの文系です(数学は悶絶するほどできません。これでも一応経済学部(略</p>
      <h3>趣味</h3>
      <p>写真撮影が好きです。月イチペースでプチ撮影旅行みたいなことをやってます。</p>
      <h2>当サイトについて</h2>
      <h3>"SKYGATE"の意味</h3>
      <p>別に”SKYGATE”という言葉自体に決まった意味がある訳ではありませんが，”Sky” + “Gate”ということで，空への玄関口すなわち空港を連想される方が多いと思います(多いのか…?)。海外への出発の地である空港に擬えて，情報発信の場としてのWebサイトでありたいという意味を込めて”SKYGATE”と名付けました。</p>
      <h3>当サイトの仕組み</h3>
      <p>ICTベーシックの課題ということもあり，本腰を入れて作りました。MVVMパターンが使えるVue.jsとNuxt.jsでサイトを構築しています。HTMLやCSS，JavaScriptをテキストエディタにゴリゴリと書いて作ってもいいんですが，ページのレイアウトを組み上げるときにコードが読みにくくなっちゃうのであえて分けて書けるフレームワークを使っています。なお，BootstrapといったUIフレームワークは一切使っていません。レスポンシブ表示にも対応しました。スマートフォンやタブレットでもご覧いただけます。</p>
      <h3>デザイン</h3>
      <p>今回は地球の自然をテーマにしたということもあり，サイトのデザインがコンテンツの邪魔をしないようシンプルなデザインに留め…ようとしましたが，せっかく作るのだから印象に残るものがいいな，ということであえて派手目の演出を加えています(トップページなんかがそうですね)。</p>
      <p>他にも，メニューバーやトップページのテキストに使用しているシャドウ(影)だったり，高コントラストな動画とキャプションの文字色など，今流行りの「セミフラットデザイン」の要素も各種に加えています。</p>
      <h3>その他こだわったところ</h3>
      <p>実は当サイト，SSR(Server Side Rendering)という特殊な仕組みで動いています。ページ間の遷移が爆速なのはそのためだったりします。</p>
      <p>トップページに動画を使用していますが，低容量で高画質を実現できるWebMという形式で圧縮しています。また，WebMに対応していないブラウザでも再生できるよう画質に最適化を施したmp4で圧縮した動画も使用しています。</p>
      <h3>ソースコード</h3>
      <p>完成したものをGitHubにアップロードしています。上メニューバーの「ソースコード」よりどうぞ。</p>
    </article>
  </section>
</template>
<style lang="scss">
</style>
